{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of5", "group1-shard2of5", "group1-shard3of5", "group1-shard4of5", "group1-shard5of5"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 32], "name": "conv1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv1_bn/gamma"}, {"dtype": "float32", "shape": [32], "name": "conv1_bn/beta"}, {"dtype": "float32", "shape": [32], "name": "conv1_bn/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "conv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "conv_dw_1/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "conv_dw_1_bn/gamma"}, {"dtype": "float32", "shape": [32], "name": "conv_dw_1_bn/beta"}, {"dtype": "float32", "shape": [32], "name": "conv_dw_1_bn/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "conv_dw_1_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv_pw_1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv_pw_1_bn/gamma"}, {"dtype": "float32", "shape": [64], "name": "conv_pw_1_bn/beta"}, {"dtype": "float32", "shape": [64], "name": "conv_pw_1_bn/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "conv_pw_1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "conv_dw_2/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "conv_dw_2_bn/gamma"}, {"dtype": "float32", "shape": [64], "name": "conv_dw_2_bn/beta"}, {"dtype": "float32", "shape": [64], "name": "conv_dw_2_bn/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "conv_dw_2_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "name": "conv_pw_2/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_2_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_2_bn/beta"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_2_bn/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "conv_dw_3/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_3_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_3_bn/beta"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_3_bn/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_3_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv_pw_3/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_3_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_3_bn/beta"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_3_bn/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_3_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "conv_dw_4/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_4_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_4_bn/beta"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_4_bn/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_4_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv_pw_4/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_4_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_4_bn/beta"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_4_bn/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_4_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "conv_dw_5/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_5_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_5_bn/beta"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_5_bn/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_5_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv_pw_5/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_5_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_5_bn/beta"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_5_bn/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_5_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "conv_dw_6/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_6_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_6_bn/beta"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_6_bn/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_6_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 256, 512], "name": "conv_pw_6/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_6_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_6_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_6_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_6_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_7/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_7_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_7_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_7_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_7_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_7/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_7_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_7_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_7_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_7_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_8/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_8_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_8_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_8_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_8_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_8/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_8_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_8_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_8_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_8_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_9/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_9_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_9_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_9_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_9_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_9/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_9_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_9_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_9_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_9_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_10/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_10_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_10_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_10_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_10_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_10/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_10_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_10_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_10_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_10_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_11/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_11_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_11_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_11_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_11_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_11/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_11_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_11_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_11_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_11_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_12/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_12_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_12_bn/beta"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_12_bn/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_12_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 512, 1024], "name": "conv_pw_12/kernel"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_12_bn/gamma"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_12_bn/beta"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_12_bn/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_12_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 1024, 1], "name": "conv_dw_13/depthwise_kernel"}, {"dtype": "float32", "shape": [1024], "name": "conv_dw_13_bn/gamma"}, {"dtype": "float32", "shape": [1024], "name": "conv_dw_13_bn/beta"}, {"dtype": "float32", "shape": [1024], "name": "conv_dw_13_bn/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "conv_dw_13_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 1024, 1024], "name": "conv_pw_13/kernel"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_13_bn/gamma"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_13_bn/beta"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_13_bn/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_13_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 1024, 1000], "name": "conv_preds/kernel"}, {"dtype": "float32", "shape": [1000], "name": "conv_preds/bias"}]}]}